Revit 2024 API
ParameterTypeId.ReferenceViewerUiTargetFilter Property
 "Filter": This is used by the UI to filter the list of target views.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId ReferenceViewerUiTargetFilter { get; }
Visual Basic
Public Shared ReadOnly Property ReferenceViewerUiTargetFilter As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ ReferenceViewerUiTargetFilter {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace